//
//  GameModel.swift
//  ChallengeOne
//
//  Created by Сергей Шевелев on 04.05.2022.
//

import Foundation

class GameModel {
    
    var settings: Settings?
    var team: [Team] = [Team]()
    var questNumber: Int = 0
    var currentTeam: Int = 0
    
    init() {
        settings = DataManager.loadSettings()
        //генерация команд
       generationTeam()
    }
    
    func generationTeam() {
        for item in 1...(settings?.countCommands ?? 1)  {
            self.team.append(Team(name: "Команда -= \(item) =-", setOfWord: settings?.setOfWords ?? 0, point: 0, count: 0))
        }
    }
    
    var jokeModel = JokeModel()

    static let easyQuestions = ["дом", "яблоко", "аквариум", "комар", "мост", "акула", "монитор", "спортсмен", "лупа", "солнце", "чеснок", "провод", "перец", "шарик", "страус", "мотор", "город", "пластилин", "расстояние", "жена", "морж", "ведро", "лень", "сок", "пират", "начальник", "дым", "береза", "море", "пылесос", "укус", "ваза", "рыба", "лопата", "месяц", "скелет", "занятие", "качели", "котенок", "лодка", "соловей", "страх", "конфета", "остров", "озеро", "сумка", "праздник", "браслет", "кошелек", "окно", "сон", "хлеб", "луна", "собака", "кресло", "курица", "дед", "друзья", "нога", "крыша", "календарь", "ребенок", "шайба", "жилет", "телефон", "нос", "лев", "мусор", "гроза", "трава", "град", "автомобиль", "скрепка", "варежки", "база", "девочка", "радость", "швабра", "ноты", "туфли", "мел", "парик", "радиация", "вафли", "бумага", "карандаш", "посуда", "донор", "мышка", "лекарство", "кондиционер", "семечки", "зубы", "юбка", "парад", "чашка", "брюки", "штраф", "театр", "порошок", "тётя", "смех", "щука", "список", "брошка", "цирк", "кубик", "фотограф", "улыбка", "маркер", "стакан", "черепаха", "палка", "хорёк", "гриб", "звезда",  "блондинка", "клетка", "столовая", "колпак", "пост", "письмо", "отличник", "барабан", "букет", "кнопка", "книга", "пони", "сестра", "череп", "брат", "раб", "лицо", "фонтан", "часы", "слон", "дельфин", "мороженое", "конверт", "провод", "идея", "ученый", "крик", "булочка", "пирожное", "конфета", "папка", "неделя", "столица", "родина", "ключ", "строчка", "швея", "больница", "звонок", "врач", "здоровье", "стихи", "броня", "круиз", "теплоход", "свет", "река", "пляж", "пальма", "бассейн", "трон", "король", "конь", "пешка", "шашки", "сабля", "мушкетер", "корона", "шуба", "указ", "салат", "мама", "линейка", "ложка", "треугольник", "занавес", "гусь", "печь", "дневник", "ёж", "ножницы", "снегурочка", "яма", "мишень", "попугай", "сказка", "кролик", "мороз", "кислота", "звонок", "лес", "пух", "лимон", "память", "маяк", "канарейка", "родня", "сапоги", "степлер", "лук", "глазок", "светофор", "пузырь", "специи", "витраж", "сердце", "подставка", "беседка", "любовь", "корыто", "звук", "ноги", "сирень", "автор", "паста", "дорога", "квартира", "дверь", "лыжи", "пельмени", "мелодия", "мускулы", "фигура", "встреча", "валенки", "шашлык", "ландыш", "лилия", "кости", "ягуар", "шпион", "дельтаплан", "одиночество", "мечта", "жест", "поэт", "бегемот", "роза", "печать", "молния", "палатка", "певец", "конец", "дятел"].shuffled() //количество слов: 250

    static let difficultQuestions = ["дальномер", "штангенциркуль", "дозор", "проушина", "па-де-де", "захребетник", "подворотня", "камертон", "лобзик", "лимонка", "скобарь", "нарзан", "окантовка", "постановщик", "утешитель", "Котофей", "перепалка", "капсюль", "поручение", "халтура", "терция", "полярник", "дезинформация", "портал", "Арарат", "стеклярус", "антипатия", "знамение", "кивок", "эпицентр", "блиц", "вист", "оторванность", "жалование", "стереотип", "лунатизм", "диспетчер", "альтист", "обществовед", "филармония", "космодром", "индуктор", "чары", "автолюбитель", "цирроз", "ворчун", "титул", "косность", "рецидив", "эпицентр", "наслаждение", "резерв", "западня", "углевод", "опахало", "ожерелье", "бальзамирование", "буйвол", "невозможность", "арап", "сбережение", "цилиндр", "приезд", "отступ", "дикция", "дамба", "бунт", "архиватор", "помещение", "толстолобик", "трескотня", "бортжурнал", "аферист", "искушение", "бич", "монополист", "сталинизм", "бортмашина", "пассия", "ксерокс", "шпулька", "каноэ", "землянка", "бездельник", "цареубийца", "винотека", "упразднение", "загородка", "радиотехник", "правота", "восшествие", "паяльник", "котировка", "приключение", "торопыга", "урон", "бирюза", "черничник", "сопротивление", "лекторий", "гребок", "повествование", "истощение", "дизайн", "заросль", "прядильщик", "рассказчик", "коневодство", "микрорайон", "картридж", "перцовка", "рассольник", "генерал-лейтенант", "одиннадцатиклассник", "роды", "горнорабочий", "чистка", "чертовщина", "тяжеловес", "киномеханик", "полярность", "пунктуация", "тар-тар", "оккультизм", "орнитолог", "налогоплательщик", "комета", "фонарщик", "дресс-код", "ферментация", "предводитель", "гомосексуальность", "берет", "экономист", "генерал-губернатор", "сортировка", "сообщество", "ничтожность", "шаманство", "приспособление", "заносчивость", "переучет", "личность", "скоропись", "полено", "семинарист", "отворот", "трансформер", "индиго", "проекция", "фюзеляж", "аварийность", "гравировщик", "плагин", "комплект", "риелтор", "иждивенец", "копна", "клавишник", "регбист", "флегматичность", "отставание", "шаль", "цинизм", "траектория", "дефолт", "кунжут", "клеймо", "соционика", "задумчивость", "рыба-луна", "колумнист", "ягнятина", "чутье", "заключение", "заглушка", "безответственность", "парусник", "отсталость", "прослушка", "овчина", "воздаяние", "погонщик", "покровитель", "урюк", "сектант", "картография", "параметр", "постфактум", "тропосфера", "маркиз", "искажение", "потасовка", "крепыш", "краснодеревщик", "циркуляция", "парапет", "индикатор", "гематома", "силомер", "портьера", "мониторинг", "инсталляция", "авангард", "подшипник", "ситуация", "кукиш", "козинаки", "шифоньер", "чушь", "папуас", "брюква", "болванка", "балетмейстер", "выпендрежник", "антураж", "доходяга", "галоши", "чехарда", "переговоры", "счет-фактура", "стимуляция", "дипломант", "рельеф", "деградация", "пролонгация", "терминал", "ваниль", "график", "пальпация", "аффирмация", "фланель", "ботильоны", "надменность", "грациозность", "перевозка", "фаянс", "проектор", "канделябр", "обольстительница", "амбразура", "трельяж", "симбиоз", "двусмысленность", "высотка", "габариты", "стойка", "гангрена", "полотно", "покрытие"].shuffled()  //количество слов: 250



    let questions = [easyQuestions, difficultQuestions]

    func skip() {
        questNumber += 1
        team[currentTeam].count += 1
        team[currentTeam].point -= 1
    }
    func trueAn() {
        questNumber += 1
        team[currentTeam].count += 1
        team[currentTeam].point += 1
    }
    
    func reset() {
        questNumber = 0
        team[currentTeam].count = 0
        team[currentTeam].point = 0
        currentTeam = 0
        team.removeAll()
        generationTeam()
    }
    
    func getWord() -> String {
        return questions[team[currentTeam].setOfWord].shuffled().first!
    }
    
    func getTeam() -> Team {
       return team[currentTeam]
    }
    
    func checkTeam() -> Bool {
        (currentTeam + 1) < team.count
    }
    
    func nextTeam() {
        currentTeam += 1
    }
    
    func getWinTeam() -> String {
        team.sorted { t1, t2 in
            t1.point > t2.point
        }.first!.name
    }
    
}
